<?
// Написать функцию, которая вычисляет текущее время и возвращает его в формате с правильными склонениями, например:
// 22 часа 15 минут
// 21 час 43 минуты

function timeNow($hour, $min) {
    if (($hour == 1) || ($hour == 21)) {
        $go .= $hour.' час ';
    }
    elseif (($hour == 0) || (($hour >= 5) && ($hour <= 20))) {
        $go .= $hour.' часов ';
    }
    else {
        $go .= $hour.' часа ';
    }
    if (($min == 1) || ($min == 21) || ($min == 31) || ($min == 41) || ($min == 51)) {
        $go .= $min.' минута';
    }
    elseif (($min >= 2 && $min <= 4) || ($min >= 22 && $min <= 24) || ($min >= 32 && $min <= 34) || ($min >= 42 && $min <= 44) || ($min >= 52 && $min <= 54)) {
        $go .= $min.' минуты';
    }
    else {
        $go .= $min.' минут';
    }
    return $go;
}

echo timeNow(date('G'), date('i'));
