<?
// Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К»

$country = ['Московская область' => ['Зеленоград', 'Клин', 'Москва'],
            'Ленинградская область' => ['Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'],
            'Рязанская область' => ['Касимов', 'Новомичуринск']
           ];
foreach ($country as $obl => $towns) {
    echo $obl.':<br>';
    foreach ($towns as $town) {
        if (mb_substr($town, 0, 1) == 'К') {
            echo $town.' ';
        }
    }
    echo '<br>';
}